In [2]:
import pandas as pd

In [9]:
df = pd.read_json("data/simple_json.json")

In [10]:
df

              title           author
0  math for dummies  charles chaplin
1     bitcoin bible  margaret tacher
2  data science 101       bill gates

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   title   3 non-null      object
 1   author  3 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes

In [13]:
df_nested = pd.read_json("data/nested_json.json")

In [14]:
df_nested

              title  ...                                          key_words
0  math for dummies  ...  [{'id': 1, 'word_1': 'algebra'}, {'id': 2, 'wo...
1     bitcoin bible  ...  [{'id': 1, 'word_1': 'coin'}, {'id': 2, 'word_...
2  data science 101  ...  [{'id': 1, 'word_1': 'machine_learning'}, {'id...

[3 rows x 3 columns]

In [16]:
import json
# load data using Python JSON module
with open('data/nested_json.json','r') as f:
    data = json.loads(f.read())
    
# Flatten data
df_nested_list = pd.json_normalize(data, record_path =['key_words'])
df_nested_list

   id            word_1
0   1           algebra
1   2          geometry
2   1              coin
3   2   crypto_currency
4   1  machine_learning
5   2    data_wrangling

In [17]:
# To include school_name and class
df_nested_list = pd.json_normalize(
    data, 
    record_path =['key_words'], 
    meta=['title', 'author']
)
df_nested_list

   id            word_1             title           author
0   1           algebra  math for dummies  charles chaplin
1   2          geometry  math for dummies  charles chaplin
2   1              coin     bitcoin bible  margaret tacher
3   2   crypto_currency     bitcoin bible  margaret tacher
4   1  machine_learning  data science 101       bill gates
5   2    data_wrangling  data science 101       bill gates

In [5]:
import json
# load data using Python JSON module
with open('data/dict_nested_json.json','r') as f:
    data = json.loads(f.read())
    
# Flatten data
df_nested_dict = pd.json_normalize(data, meta=['key_words'])
df_nested_dict

              title           author  ...  key_words.word_1 key_words.word_2
0  math for dummies  charles chaplin  ...           algebra         geometry
1     bitcoin bible  margaret tacher  ...              coin            money
2  data science 101       bill gates  ...  machine_learning     data_science

[3 rows x 5 columns]